{
  "name": "Arjuna",
  "fullBiography": [
    {
      "title": "Birth and Divine Heritage",
      "content": "Arjuna was born to Queen Kunti through the blessings of Indra, the king of gods. His divine parentage bestowed upon him unmatched valor, skill in warfare, and mastery over celestial weapons."
    },
    {
      "title": "Early Education",
      "content": "Under Guru Drona’s tutelage, Arjuna excelled in archery and warfare. He became Drona’s favorite disciple and surpassed his peers with his dedication, discipline, and natural talent."
    },
    {
      "title": "The Archer’s Excellence",
      "content": "Arjuna’s unwavering focus and determination were displayed in the famous bird’s eye test, where he alone concentrated solely on the eye of the bird, proving his unmatched precision in archery."
    },
    {
      "title": "Winning Draupadi’s Hand",
      "content": "In the swayamvara of Draupadi, Arjuna, disguised as a Brahmin, accomplished the difficult task of stringing the bow and hitting the target. This won him Draupadi’s hand in marriage, later shared by all five Pandavas due to Kunti’s command."
    },
    {
      "title": "Acquisition of Divine Weapons",
      "content": "Arjuna performed severe penances to obtain celestial weapons. He received the Pashupatastra from Lord Shiva after proving his valor in disguise and many other weapons from the gods, making him the most formidable warrior of his time."
    },
    {
      "title": "Exile and Adventures",
      "content": "During the Pandavas’ exile, Arjuna traveled widely, acquiring divine weapons, marrying Ulupi, Chitrangada, and Subhadra, and expanding his legacy. His union with Subhadra, Krishna’s sister, produced Abhimanyu, a warrior prince."
    },
    {
      "title": "Role in the Kurukshetra War",
      "content": "Arjuna played a decisive role in the war as the chief warrior of the Pandavas. Guided by Krishna as his charioteer, he fought valiantly against Bhishma, Karna, Jayadratha, and many others, changing the course of the battle."
    },
    {
      "title": "The Bhagavad Gita",
      "content": "At the onset of the war, Arjuna was overcome with despair at fighting his kin. Krishna imparted the Bhagavad Gita to him, teaching him about duty, righteousness, devotion, and the path to liberation. This moment remains the philosophical heart of the Mahabharata."
    },
    {
      "title": "Victory Over Karna",
      "content": "One of Arjuna’s greatest duels was with Karna, his equal in valor. With Krishna’s guidance, Arjuna defeated Karna in a legendary battle, marking a turning point in the war."
    },
    {
      "title": "Later Life",
      "content": "After the war, Arjuna ruled along with his brothers and later accompanied Yudhishthira on the great journey to the Himalayas. Along the way, he succumbed, unable to complete the final path to heaven."
    },
    {
      "title": "Legacy",
      "content": "Arjuna is remembered as one of the greatest warriors of all time, the devotee of Krishna, and the recipient of the divine wisdom of the Bhagavad Gita. His life embodies valor, devotion, and spiritual awakening."
    }
  ]
}
