{
  "name": "Dronacharya",
  "fullBiography": [
    {
      "title": "Birth and Lineage",
      "content": "Drona was born to sage Bharadwaja. Though a Brahmin, he had a deep interest in weapons and martial science, making him unique among sages' children."
    },
    {
      "title": "Education and Training",
      "content": "He trained under Sage Parashurama, mastering divine astras and all forms of warfare. His mastery made him one of the greatest warriors of his time."
    },
    {
      "title": "Poverty and Friendship with Drupada",
      "content": "Drona shared a childhood friendship with Prince Drupada, who once promised him support. Later, when Drona sought help in poverty, Drupada insulted him, leading to a lifelong enmity."
    },
    {
      "title": "Becoming the Guru of Kuru Princes",
      "content": "Drona became the royal guru of both Pandavas and Kauravas at Hastinapura. Under his tutelage, Arjuna excelled in archery, earning his teacher’s greatest admiration."
    },
    {
      "title": "Arjuna as the Favored Student",
      "content": "Recognizing Arjuna’s dedication, Drona taught him advanced archery, making him one of the greatest warriors. Drona’s favoritism toward Arjuna created jealousy among others, especially Karna."
    },
    {
      "title": "Revenge Against Drupada",
      "content": "To fulfill his vow of revenge, Drona asked his disciples to capture King Drupada. The Kauravas failed, but Arjuna succeeded, thus humiliating Drupada. Later, Drona magnanimously returned half the kingdom, but the rivalry persisted."
    },
    {
      "title": "Role in the Kurukshetra War",
      "content": "Bound by duty to Hastinapura, Drona fought on the Kaurava side. After Bhishma’s fall, he became commander-in-chief of the Kaurava army, demonstrating unmatched strategy and skill."
    },
    {
      "title": "The Death of Abhimanyu",
      "content": "Under his command, the Chakravyuha formation was arranged, which led to the tragic death of Abhimanyu, Arjuna’s son. This act turned the tide of emotions against him."
    },
    {
      "title": "Deception and Death",
      "content": "Drona could not be defeated in direct battle. Ultimately, he was deceived when Yudhishthira, under Krishna’s counsel, declared ‘Ashwatthama is dead’ (referring to an elephant). Distraught, Drona laid down his arms, allowing Dhrishtadyumna to kill him."
    },
    {
      "title": "Legacy",
      "content": "Dronacharya is remembered as one of the greatest gurus in history. Despite his greatness, his loyalty to the throne and personal grudges clouded his judgment, making him a tragic figure of dharma versus duty."
    }
  ]
}
