{
  "name": "Krishna",
  "fullBiography": [
    {
      "title": "Birth and Early Life",
      "content": "Krishna was born to Devaki and Vasudeva in the Yadava clan, in Mathura. Due to a prophecy that Devaki's son would slay the tyrant Kamsa, Krishna was smuggled across the Yamuna River to Gokul, where he was raised by Nanda and Yashoda."
    },
    {
      "title": "Childhood Miracles",
      "content": "As a child, Krishna displayed divine powers by slaying demons like Putana, Trinavarta, and Bakasura. His playful acts, such as stealing butter and playing the flute, earned him the love of the Gopis of Vrindavan. His lifting of Govardhan Hill to protect the villagers from Indra’s wrath established him as divine protector."
    },
    {
      "title": "Role in Mathura and Dwarka",
      "content": "Krishna killed Kamsa, liberating Mathura from tyranny. Later, he established the city of Dwarka, where he ruled as king and guided the Yadava clan. His role as a statesman and diplomat became crucial in the larger political landscape of Bharatavarsha."
    },
    {
      "title": "Friendship with the Pandavas",
      "content": "Krishna shared a close bond with the Pandavas, especially Arjuna and Draupadi. He saved Draupadi during her humiliation in the Kaurava court and offered guidance to the Pandavas throughout their trials and exile."
    },
    {
      "title": "Diplomatic Mission Before War",
      "content": "Before the Kurukshetra war, Krishna tried to mediate peace by proposing a compromise to Duryodhana. However, his efforts were rejected, making the war inevitable. His diplomacy showcased his commitment to righteousness while avoiding unnecessary bloodshed."
    },
    {
      "title": "Charioteer of Arjuna",
      "content": "During the Kurukshetra war, Krishna chose not to wield weapons but instead became Arjuna’s charioteer. His presence was a source of strength for the Pandavas, and his tactical guidance on the battlefield often turned the tide in their favor."
    },
    {
      "title": "The Bhagavad Gita",
      "content": "On the battlefield, when Arjuna was overcome with despair, Krishna revealed the Bhagavad Gita, a divine discourse on duty, righteousness, devotion, and the eternal soul. This spiritual teaching became one of the most profound scriptures in Indian philosophy."
    },
    {
      "title": "Role in the War",
      "content": "Krishna guided the Pandavas with strategy, often using unconventional means to ensure victory for dharma. Examples include advising Bhima to strike Duryodhana’s thigh and instructing Yudhishthira to mislead Drona about Ashwatthama."
    },
    {
      "title": "Later Life",
      "content": "After the war, Krishna returned to Dwarka. Eventually, due to internal conflicts within the Yadava clan, a great civil war broke out, leading to the destruction of his own people. Krishna accepted this as destiny."
    },
    {
      "title": "Departure from Earth",
      "content": "Krishna departed the mortal world when a hunter named Jara mistakenly shot him in the foot with an arrow. His death marked the beginning of Kali Yuga. Despite leaving his earthly form, he continues to be revered as the supreme divine being."
    },
    {
      "title": "Legacy",
      "content": "Krishna remains one of the most beloved and revered deities in Hinduism. His teachings, particularly the Bhagavad Gita, and his life stories in the Mahabharata and the Bhagavata Purana continue to inspire spiritual seekers across the world."
    }
  ]
}
