{
  "name": "Kunti",
  "fullBiography": [
    {
      "title": "Birth and Early Life",
      "content": "Kunti, originally named Pritha, was the daughter of King Shurasena and was adopted by her childless uncle Kuntibhoja, after whom she came to be known as Kunti. As a young girl, she displayed wisdom and maturity beyond her age."
    },
    {
      "title": "The Divine Boon",
      "content": "Kunti received a boon from Sage Durvasa for her service and devotion. This boon allowed her to invoke any god and have a child by them. Out of curiosity, she invoked the Sun God and gave birth to Karna, whom she had to abandon as an infant due to societal norms."
    },
    {
      "title": "Marriage to Pandu",
      "content": "Kunti was married to Pandu, the king of Hastinapura. Due to a curse, Pandu could not father children, which led Kunti to use her divine boon. Through this, she bore Yudhishthira (by Yama), Bhima (by Vayu), and Arjuna (by Indra). She also shared her boon with Madri, Pandu’s second wife, leading to the birth of Nakula and Sahadeva (by the Ashwini Kumaras)."
    },
    {
      "title": "Motherhood and Struggles",
      "content": "After Pandu’s death, Kunti assumed the responsibility of raising her children. She guided the Pandavas through numerous challenges, including attempts on their lives by Duryodhana, their years in exile, and the humiliations they endured. Her strength and wisdom were pivotal in shaping the Pandavas’ character."
    },
    {
      "title": "Life in Exile",
      "content": "During the Pandavas’ exile, Kunti stayed with them, enduring hardships without complaint. She inspired them to uphold dharma even in adversity, reinforcing her role as a guiding force in their lives."
    },
    {
      "title": "The Secret of Karna",
      "content": "One of Kunti’s greatest burdens was the secret of Karna’s birth. On the eve of the Kurukshetra war, she revealed to Karna that he was her eldest son, but he chose to remain loyal to Duryodhana. This revelation highlighted Kunti’s deep emotional struggles as a mother caught between duty and love."
    },
    {
      "title": "After the War",
      "content": "Following the Kurukshetra war and the Pandavas’ victory, Kunti retired to the forest along with Dhritarashtra and Gandhari. She renounced worldly life and lived in meditation and simplicity."
    },
    {
      "title": "Death and Legacy",
      "content": "Kunti met her end in a forest fire, attaining peace after a life of immense sacrifice and duty. She is remembered as one of the most influential women of the Mahabharata, whose decisions shaped the destiny of the epic."
    },
    {
      "title": "Legacy",
      "content": "Kunti is remembered for her resilience, faith, and the sacrifices she made for her children. Despite her hardships, she became a symbol of strength and motherhood in Indian tradition."
    }
  ]
}
