{
  "name": "Nakula",
  "fullBiography": [
    {
      "title": "Birth and Heritage",
      "content": "Nakula was born to Queen Madri through the blessings of the Ashwini Kumaras, divine physicians of the gods. Along with his twin brother Sahadeva, Nakula inherited beauty, intelligence, and skills associated with medicine and horse-keeping."
    },
    {
      "title": "Childhood and Training",
      "content": "After the untimely death of his mother, Nakula and Sahadeva were raised by Kunti along with the other Pandavas. Under the guidance of Guru Drona and Sage Kripa, Nakula excelled in swordsmanship, horsemanship, and warfare. His beauty was so striking that he was often called the most handsome man of his time."
    },
    {
      "title": "Expertise in Horses",
      "content": "Nakula was a master in the care and training of horses. His knowledge of equestrian arts and veterinary medicine was unmatched, and he was revered for his ability to manage cavalry in times of war and peace."
    },
    {
      "title": "Marriage and Family",
      "content": "Nakula married Karenumati, the daughter of King Chedi, and had a son named Niramitra. His marriage further strengthened the Pandavas’ alliances across kingdoms."
    },
    {
      "title": "Exile and Life in Virata’s Kingdom",
      "content": "During the incognito exile of the Pandavas, Nakula assumed the role of a horse-keeper in King Virata’s stables. Despite his royal birth, he performed his duties with humility and discipline, earning admiration for his skill."
    },
    {
      "title": "Role in the Kurukshetra War",
      "content": "Nakula fought bravely in the Kurukshetra war, displaying exceptional skill in swordsmanship and archery. He fought against warriors like Karna and Duryodhana’s brothers, standing firmly beside his brothers throughout the conflict."
    },
    {
      "title": "Rule after the War",
      "content": "After the victory in the war, Nakula was crowned king of northern Madra. He ruled wisely and with fairness, ensuring prosperity and dharmic governance in his kingdom."
    },
    {
      "title": "Final Journey",
      "content": "Nakula accompanied his brothers and Draupadi on the Mahaprasthana, the final pilgrimage to the Himalayas. On the journey, he was the third to fall, a result of his pride in his beauty, though he never let arrogance overshadow his loyalty and duty during his life."
    },
    {
      "title": "Legacy",
      "content": "Nakula is remembered as the embodiment of beauty, humility, and skill. His dedication to his brothers, his mastery of horses, and his dharmic life continue to make him one of the most respected characters of the Mahabharata."
    }
  ]
}
