{
  "name": "Sahadeva",
  "fullBiography": [
    {
      "title": "Birth and Heritage",
      "content": "Sahadeva was the youngest son of Pandu, born to Queen Madri through the blessings of the Ashwini Kumaras, the twin gods of medicine. Along with his twin brother Nakula, he inherited divine qualities of intelligence, charm, and health."
    },
    {
      "title": "Childhood and Education",
      "content": "Raised under the care of Kunti after the death of his mother Madri, Sahadeva grew up in Hastinapura alongside his elder brothers. He received training from Guru Drona in warfare, swordsmanship, and dharma. However, he was most renowned for his knowledge of astrology and wisdom."
    },
    {
      "title": "Astrological Wisdom",
      "content": "Sahadeva possessed profound knowledge of astrology and could foresee events of the future. It is said that he knew the outcome of the Kurukshetra war but kept silent, as he had vowed not to reveal destiny unless asked directly."
    },
    {
      "title": "Exile and Forest Life",
      "content": "During the 13 years of exile, Sahadeva remained calm and loyal, offering his wisdom in difficult times. In the year of incognito exile, he served as a cowherd in King Virata’s kingdom, demonstrating humility and discipline."
    },
    {
      "title": "Marriage",
      "content": "Sahadeva married Vijaya, the daughter of King Dyutimat of Madra, and had a son named Suhotra. His family ties extended his dharmic responsibilities as a father and ruler."
    },
    {
      "title": "Role in Kurukshetra War",
      "content": "In the great war, Sahadeva fought valiantly on the side of the Pandavas. He was known for his swordsmanship and kept his vow of killing Shakuni, who had insulted Draupadi and orchestrated the dice game. Sahadeva fulfilled this vow by slaying Shakuni on the battlefield."
    },
    {
      "title": "Rule after the War",
      "content": "After the Pandavas’ victory, Sahadeva ruled over southern Madra, bringing prosperity and justice to his people. His wisdom and righteousness reflected in his governance."
    },
    {
      "title": "Final Journey",
      "content": "When the Pandavas renounced their kingdom and began their final journey toward the Himalayas, Sahadeva accompanied his brothers and Draupadi. On the way, he was the second to fall, due to his pride in his wisdom, which he considered unparalleled."
    },
    {
      "title": "Legacy",
      "content": "Sahadeva is remembered as the wise and loyal Pandava, whose humility and knowledge guided his brothers through challenges. Though he met an early fall in the Mahaprasthana, his role in fulfilling dharma and slaying Shakuni remains immortal in the Mahabharata."
    }
  ]
}
